using System;

namespace frequency
{
    class Program
    {
        static void Main(string[] args)
        {
            //Console.WriteLine( Translate.freq("שלום לכולם", 'ל'));
            //Translate.ExelLetters();
            // Console.WriteLine(text);
            //  Translate.deciphering("אאבגדהההדשגכעגכ");
            Translate.deciphering("ספדגמי  ביוגחימי  יתיגמי  יקזממי  יבאממלמי  ליזנ  אימק  כתפטמשגחמנצ  תפ  כילפט  יסדג  כזאמי  טקמגפא  כתקי  וגנמ  מב  יבתשמי  פהמפק  צקגפבמי  כזגפל  יסדג  יקזמ  פכטאס  תא  צאפהתפא  בכפ צשמדפגא  זכ  יתיגמי  יקזמי  תמטצ  יחאממיא  כתסג  וגחפיי  צי  טיהת  אסא  שמדפגא  דוקטמא  שכאמ  ופחדא  דפגת  ינמכ  חוד  שיתיג  יקזמ  מלפכ  כוטפא  כספדג  צסאפי  זכ  ציתיג  תפ  כספדג  צגתבמ  שידגצ  בכ  הפפא  ספדגמי  פכשדב  תא  צימקז  ציכת  כשקמדצ  זהיתמא  פצספדג  סממש  כחוד  תפאפ  לל  דפגתמי  צינמכמי  חוד  שאפהתפא  מלפכמי  כשקפד  תפאט  סכד  ילאשמ  זא  יאסממשמי  כוגחי  יתיג  ביפלמס  נזפא  בטזבאצ  שיתיג  תסג ספדגמי  בפתומי  כשמדפגא  יאיקא  עפ  כוגחפי  ציסדגמי  בכצי  שלאשמ  זא  יקזממי  צאצמכצ  ציאכפפצ  כוגחפי  שזמאפטפא  צמת  טסיקצ  תל  תמטצ  יבאפפצ  כצלגצ  בכ  צדצמכצ  ציקזמא  דשפהא  צזימאמי  בכ  צספדג  ציקזמ  וגחפי  ציסדג  שלאש  זא  יקזמ  צפת  זקפא  כלל  בספדגמי  תסגמי  ילמגמי  שלל  בציסדג  שזכ  זגל  צאפהתפא  פצזקפמפא  בכפ  יבלטזפא  פצפת  יסקב  שאספי  בשפ  צפת  זפחד  צבתמוצ  בכ  צדצמכצ  ציקזמא  צמת  אימק  כציבמל  פכסדפג  כציבמל  פכרכפא  רי  לתבג  רמכפממי  תכצ  יוגמלמי  מקז  דפקי  תמט  ספדג  צבפתו  כוגחי  תא  ציסדגמי  בכפ  ששיפא  בתמטט  ידהפזמפא  בתמט  שצט  שמדפגא בטמ  יתוממטמי  בכ  לאשמ  צזא  בשצי  יאוגחימי  יתיגמי  זפעגמי  כצזמק  זכ  תמלפאפ  בכ  ציסדג  בתטפ  שפסטמי  צטפבת  פצקמגפר  יתיגמי  יקזממי  גהמטממי  מאוגחיפ  שקגל  לככ  שלאשמ  זא  צזפחדמי  שטפבת  יחפמי  פכת  שוגחפי  צידשץ  יסדגמי  יאספימי  בפטמי  ככת  צשסטצ  שטפחו  לאשמ  זא  יקזממי  יקפגרמי  זכ  ומ  תמלפאי  ימקז  בצפת  טרמב  כהמשפג  זפגלמ  לאשמ  צזא  צתכצ  יסובמי  יתיגמי  גהמטממי  סבפשמי  פופגהמ  קגל  ילמפפט  בלל  צי  בפיגמי  זכ  ציפטמנמט  צידהפזממי  בכצי  יסק  פיפבלמי  דפגתמי  יתמקל  יתיג  ציאוגחי  שלאש  זא  עטמס  הגמל  כצקכמד  טפגא  תעצגצ  ביבצפ  שפ  זכפכ  כצמפא  שזממאמ יתוממט  טפחו  בכ  יתיגמי  יקזממי  צישקמכ  תפאי  יוגחפימי  תסגמי  צפת  בידפג  צימיפט  בכ  ציסדג  יהפמט  שיופגב  שיתיג  רפומי  גשמי  יייטמי  יסדגמי  יקזממי   דגטפא  המשפגמפא  פוגנמפא  תפטמשגחמנתפא  פרי  רפומי  יחסגממי  שמבגתכ  כיבכ  יסדגמי  גשמי  ייפיטמי  זכ  מקמ  דגטפא  בכ  יבגק  ציקז  יבגק  צשגמתפא  צתמספק  צתמגפומ  פתגרפטמי  ליפ  צתרפקצ  כיכסיצ  שחגנט  צתרפקצ  צמבגתכמא  כחפלגא  פתסגמי  תי  יארכצ  בספדג  צחאמג  תא  ידפגפא  צימיפט  בכפ  תפ  במדג  שטפרז  כצי  צקשג  ינמכ  סבק  לשק  פימקמ  זכ  ציסדג  בכפ קגל  תסגא  כעצפא  יתיגמי  יקזממי  צמת  זכ  ומ  יתרגמ  צימקז  בשצי  צי  ידפנכרמי  שטמרפק  כסמופב  סחג  תשסטצ  שגבא  סמופב  שיתרגמי  תכצ  מטמש  גד  אפהתפא  בכ  יתיגמי  יידפגפא  צמקפזמי  לתימטמי  רי  תע  צסמופב  שיתרגמי  תמטפ  זטממט  בכ  יצ  שלל  פמב  כשספג  שדומקצ  תא  יפטסמ  צסמופב  לקמ  בצאפהתפא  במאדשכפ  מצמפ  גכפפטנמפא  כטפבת  בשפ  תטפ  זפחדמי");
            Console.ReadLine();
            
        }
    }
}
